ConsultationMesuresDetailleesV2.0/C4-PRC-NA/request.xml

<?xml version="1.0" ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns0="http://www.enedis.fr/sge/b2b/services/consultationmesuresdetaillees/v2.0" xmlns:ns1="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <ns1:Body>
    <ns0:consulterMesuresDetaillees>
      <demande>
        <initiateurLogin>sge-tiers@votre-entreprise.fr</initiateurLogin>
        <pointId>30001642617347</pointId>
        <mesuresTypeCode>COURBE</mesuresTypeCode>
        <grandeurPhysique>PRC</grandeurPhysique>
        <soutirage>true</soutirage>
        <injection>false</injection>
        <dateDebut>2022-01-05</dateDebut>
        <dateFin>2022-01-12</dateFin>
        <mesuresCorrigees>false</mesuresCorrigees>
        <accordClient>true</accordClient>
      </demande>
    </ns0:consulterMesuresDetaillees>
  </ns1:Body>
</SOAP-ENV:Envelope>
